# SeekItemId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SeekItemId Property
ParameterTypeId Class See Also
---
"Seek Item ID"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SeekItemId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SeekItemId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SeekItemId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace